package com.android.www.DrivingLicenseTest.Main;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

/**
 * Created by ashokumarshrestha on 3/19/17.
 */



class DataProvider {
    public static HashMap<String,List<String>> getInfo()

    {
        HashMap<String, List<String>> HeaderDetails = new HashMap<String, List<String>>();
        List<String> ChildDetails1 = new ArrayList<String>();
        ChildDetails1.add("सवारी तथा यातायात व्यवस्था ऐन, २०४९ अनुसार सवारी चालक अनुमतिपत्र प्राप्त गर्नका लागि दरखास्त दिने व्यक्तिको देहाय बमोजिम अयोग्यता नभएको हुनुपर्नेछ ।\n" +
                "\n" +
                "१) ठूलो सवारीको निम्ति २१ वर्षनपुगेको व्यक्ति ।\n" +
                "२) मझौला तथा साना सवारीको निम्ति १८ वर्ष नपुगेको ।\n" +
                "३) मोटरर्साईकल तथा त्यस्तै अन्य सानो २ पांग्रे सवारीको हकमा १६ वर्षउमेर नपुगेको ।\n" +
                "४) छारे रोग भएको वा बौलाएको वा एकाएक रिङ्गटा लाग्ने वा मुर्छा हुने किसिमको रोग भएको व्यक्ति ।\n" +
                "५) आँखाको देख्ने शक्ति कमजोर भई चश्मा प्रयोग गर्दा पनि सामान्य तवरले देख्ने शक्ति ठीक नभएको व्यक्ति ।\n" +
                "६) साधारण ध्वनी संकेत, आवाज सुन्न नसक्ने गरी बहिरो भएको व्यक्ति ।\n" +
                "७) रातो, हरियो, पहेंलो इत्यादि रङ्गहरु तुरुन्त छुट्याउन नसक्ने (Colour Blind), दृष्टिदोष भएको व्यक्ति ।\n" +
                "८) रतन्धो भएको व्यक्ति ।\n" +
                "९) हात खुट्टा शक्तिहीन भै काम दिन नसक्ने भएको व्यक्ति । तर, अपाङ्गको निमित्त खास किसिमले बनेको सवारीको निमित्त यो खण्डको बन्देज लागू हुने छैन ।\n" +
                "१०)ठूलो र मझौला र्सार्वजनिक सवारीको लागि ६० वर्षउमेर पुरा भएको कुनै पनि व्यक्ति ।\n" +
                "११)सानो सवारी चलाएको २ वर्षपुरा नभएसम्म मझौला र ठूलो सवारी चलाउन चालक अनुमतिपत्र दिईने छैन ।\n" +
                "१२)नेपाली भाषामा साधारण लेखपढ गर्न नजान्ने ।");

        List<String> ChildDetails2 = new ArrayList<String>();
        ChildDetails2.add("सवारी चालक अनुमतिपत्र लिन चाहने माथि उल्लेखित बमोजिम अयोग्य नभएको व्यक्तिले तोकिएको ढाँचा -यस वेभर्साईटवाट डाउनलोड गर्न समेत सकिने) बमोजिमको निवेदन फाराममा रु. ५। को टिकट टाँसी तोकिए बमोजिमको दस्तुर वुझाई देहायबमोजिमका कागजातहरु संलग्न गरी -नेपाल भरका सवारी चालक अनुमतिपत्र प्रदान गर्ने कुनै पनि यातायात व्यवस्था कार्यालयहरुमा) दरखास्त पेश गर्नुपर्नेछः\n" +
                "\n" +
                "सवारी चालक अनुमतिपत्र दरखास्त दस्तुर वापत रु २००/- (ठूला सवारी¸ मझौला सवारी¸ र साना सवारी सवैकालागी) बुझाई सो को सक्कल भौचर दरखास्त साथ पेश गर्नुपर्नेछ । तर एउटै दरखास्तबाट एकभन्दा बढी किसिमका सवारी चलाउन इजाजतको लागि दरखास्त दिन चाहेको हकमा जति किसिमको सवारी चलाउने इजाजतको लागि दरखास्त दिएको हो सो को छुट्टाछुट्टै दस्तुर लाग्नेछ ।\n" +
                "\n" +
                "दरखास्त साथ देहायबमोजिमका कागजपत्रहरु पेश गर्नुपर्नेछ । \n" +
                "चालक अनुमतिपत्रको दरखास्त दस्तुर बुझाएको निस्सा । \n" +
                "नेपाली नागरिकताको प्रमाणपत्रको प्रमाणित प्रतिलिपि । \n" +
                "निरोगिताको सम्बन्धमा नेपाल सरकारद्वारा मान्यताप्राप्त चिकित्सकले नियमावलीको अनुसूची-१८ बमोजिमको ढाँचामा प्रमाणित गरेको निरोगिताको प्रमाणपत्र । \n" +
                "आफूले चलाउन चाहेको सवारीको सम्बन्धमा विभागबाट मान्यताप्राप्त प्रशिक्षण केन्द्रबाट प्राप्त प्रमाणपत्रको प्रमाणित प्रतिलिपि । \n" +
                "हालसालै खिचिएको तीनप्रति पासपोर्ट र्साईजको फोटो । \n" +
                "गैर नेपाली नागरिकहरुले आफ्नो पासपोर्टको प्रतिलिपि र नेपालमा बस्नुपर्नाको यथोचित कारणसमेत खुलाई सम्बन्धित निकायले प्रमाणित गरिदिएको सक्कल पत्र । \n" +
                "अन्य देशबाट चालक अनुमतिपत्र प्राप्त व्यक्तिले नेपाली चालक अनुमतिपत्रका लागि दरखास्त दिंदा आफूले प्राप्त गरेको चालक अनुमतिपत्रको प्रमाणित प्रतिलिपि, पासपोर्टको प्रतिलिपि र नेपालमा बस्नुपर्नाको यथोचित कारणसमेत खुलाई सम्बन्धित निकायले प्रमाणित गरिदिएको सक्कलै पत्र ।");
        List<String> ChildDetails3 = new ArrayList<String>();
        ChildDetails3.add("प्राप्त दरखास्त निवेदनहरु यातायात व्यवस्था कार्यालयमा सिलसिलेवार नम्बर मिलाई सवन्धित कार्यालयले दर्ता गरि राखिन्छ । चालक अनुमतिपत्र प्राप्त गर्नका लागि पर्न आएका दरखास्त फाराममा उल्लेख गरेका विवरणहरु तथा दरखास्तसाथ पेश गरेका कागजातहरु दुरुस्त भए नभएको वारेमा सम्बन्धित कार्यालयले छानविन गरि स्वीकृत दरखास्तवालाहरुलाई परीक्षा मिति र समयसमेत उल्लेख गरी प्रवेशपत्र उपलव्ध गर्राईन्छ र दरखास्त दिने अन्तिम म्याद समाप्त भएपछि स्वीकृत दरखास्तवालाको नामावाली कार्यालयले प्रकाशित गरिन्छ ।\n" +
                "सम्पुर्ण कागजातहरुसहितको नयाँ चालक अनुमतिपत्रका लागि निवेदन प्राप्त भएपछि त्यसको रुजु गरी ठीक भएमा कार्यालय प्रमुख/ शाखा अधिकृतद्वारा निवेदन दर्ताका लागि सम्बन्धित फाँटमा पठाइन्छ । सम्बन्धित फाँटवालाले निवेदन दर्ता गरी परीक्षाको मिति र समय तोकी परीक्षार्थीलाई सोही दिन प्रवेशपत्र दिइन्छ। यसरी परीक्षाको मिति तोक्दा सामान्यतया निवेदन दर्ता भएको मितिले ७ दिनभित्रको हुन्छ ।");
        List<String> ChildDetails4 = new ArrayList<String>();
        ChildDetails4.add("Tप्राप्त दरखास्त निवेदनहरु यातायात व्यवस्था कार्यालयमा सिलसिलेवार नम्बर मिलाई सवन्धित कार्यालयले दर्ता गरि राखिन्छ । चालक अनुमतिपत्र प्राप्त गर्नका लागि पर्न आएका दरखास्त फाराममा उल्लेख गरेका विवरणहरु तथा दरखास्तसाथ पेश गरेका कागजातहरु दुरुस्त भए नभएको वारेमा सम्बन्धित कार्यालयले छानविन गरि स्वीकृत दरखास्तवालाहरुलाई परीक्षा मिति र समयसमेत उल्लेख गरी प्रवेशपत्र उपलव्ध गर्राईन्छ र दरखास्त दिने अन्तिम म्याद समाप्त भएपछि स्वीकृत दरखास्तवालाको नामावाली कार्यालयले प्रकाशित गरिन्छ ।\n" +
                "सम्पुर्ण कागजातहरुसहितको नयाँ चालक अनुमतिपत्रका लागि निवेदन प्राप्त भएपछि त्यसको रुजु गरी ठीक भएमा कार्यालय प्रमुख/ शाखा अधिकृतद्वारा निवेदन दर्ताका लागि सम्बन्धित फाँटमा पठाइन्छ । सम्बन्धित फाँटवालाले निवेदन दर्ता गरी परीक्षाको मिति र समय तोकी परीक्षार्थीलाई सोही दिन प्रवेशपत्र दिइन्छ। यसरी परीक्षाको मिति तोक्दा सामान्यतया निवेदन दर्ता भएको मितिले ७ दिनभित्रको हुन्छ ।");
        List<String> ChildDetails5 = new ArrayList<String>();
        ChildDetails5.add("उत्तर पुस्तिका परीक्षण गर्दा उपयुक्त एवम् दक्ष व्यक्तिसमक्ष जाँचको लागि सिलबन्दी अवस्थाको उत्तर पुस्तिका गोप्यरुपबाट पठाइन्छ ।उत्तर पुस्तिका परीक्षण गर्ने जिम्मेबारी पाएका व्यक्तिले गोप्यरुपमा परीक्षण गर्ने कार्य सम्पन्न गरेपछि निर्धारित समयभित्र अङ्क चर्ढाई सम्बन्धित कार्यालयमा आइपुग्नेछ । यसरी प्राप्त उत्तरपुस्तिकाहरुमा सवै उत्तरहरु परिक्षण गरी अङ्क दिए नदिएको, अंकहरु जोडे नजोडेको रुजु गरिन्छ । उत्तर पुस्तिकाहरु परीक्षण तथा रुजु पश्चात् प्राप्त नतिजाको आधारमा परिक्षा समितिले कम्तिमा ६० प्रतिशत अङ्क प्राप्त गर्ने परीक्षार्थीलाई उत्तिर्ण मानी सामान्यतया परीक्षाको भोलीपल्ट परिक्षार्थीहरुको रोल नं. क्रमानुसार नतिजा प्रकाशित गरी कार्यालयको सूचनापाटीमा टाँस गरिन्छ ।");
        List<String> ChildDetails6 = new ArrayList<String>();
        ChildDetails6.add("लिखित परीक्षामा उत्तिर्ण भएका परीक्षार्थीहरुको सामान्यतया बढीमा १ हप्ताभित्र प्रयोगात्मक परीक्षा लिइन्छ । अन्तरवार्ता सहितको प्रयोगात्मक परीक्षा -ट्रायल) परिक्षा समितिले तोके बमोजिमको स्थान, समय र मितिमा लिइन्छ । \n" +
                "प्रयोगात्मक परिक्षामा परिक्षार्थीले सवारी साधन चलाउन सक्ने नसक्ने वारेमा प्रयोगात्मक विधिवाट परिक्षा लिईन्छ । यसका सम्पूर्ण गतिविधिलाई सम्बन्धित यातायात व्यवस्था कार्यालय तथा यातायात व्यवस्था विभागबाट समेत सिसिटिभी मार्फत अवलोकन गरि पारदर्शी परिक्षा प्रणाली अवलम्बन गरिन्छ ।  ट्रयाक्टर तथा पावर टिलरको लागि दरखास्त दिने दरखास्तवालाहरुको योग्यता परीक्षण अन्तरवार्ता सहितको प्रयोगात्मक परीक्षाबाट गरिन्\u200Dछ । \n" +
                "लिखित परीक्षा र अन्तरवार्तासहितको प्रयोगात्मक परीक्षासमेतबाट उत्तिर्ण भइ अन्तिम छनौटमा परी समितिबाट सिफारिस भएका व्यक्तिमात्र सवारी चालक अनुमतिपत्र प्राप्त गर्न योग्य हुनेछन् । प्रयोगात्मक परीक्षा सम्पन्न भएको भोलीपल्ट सफल परीक्षार्थीहरुको नतिजा कार्यालयको सूचनापाटीमा टाँस गरीन्छ । \n" +
                "परिक्षा समितिबाट सिफारिस भएका योग्य व्यक्तिहरुलाई परीक्षाफल प्रकाशित भएको मितिले बढीमा १ हप्ताभित्र निजहरुबाट नियमावली बमोजिम लाग्ने चालक अनुमतिपत्र जारी दस्तुर बुझाएको निस्सा र उर्त्तिण भएको रोल नं. आदि साथ पेश भएपछि कार्यालयमा खडा गरी राख्नुपर्ने सम्पुर्ण अभिलेखहरु तयार गरी फाइलमा सम्बन्धित व्यक्तिको दरखास्त फाराम र सोसाथ पेश गरेका सम्पूर्ण कागजातहरु सुरक्षित राखि सम्बन्धित कार्यालयका अधिकार प्राप्त अधिकारीबाट चालक अनुमतिपत्र प्रदान हुन्छ । \n" +
                "चालक अनुमतिपत्र कुन प्रकारको सवारी चलाउनका लागि जारी भएको हो उक्त प्रकारको सवारीबाहेक अन्य सवारीको नामको अगाडिको प्रकोष्टमा स्थायी मसी भएको मार्कर कलमले रातो मसी लगाईनेछ ।");
        List<String> ChildDetails7 = new ArrayList<String>();
        ChildDetails7.add("प्राप्त गरेको चालक अनुमतिपत्रमा उल्लिखित सवारीका अतिरिक्त अन्य कुनै सवारी समावेश गराउन चाहेमा चालकले आफुले समावेश गराउन चाहेको सवारीको किसिम खुलाई निर्दिष्ट ढाँचामा रु २०० को भाउचर सहीत त्यस्तो अनुमतिपत्र दिने यातायात व्यवस्था कार्यालयमा दरखास्त दिनुपर्नेछ ।\n" +
                "\n" +
                "प्राप्त दरखास्त साथ संलग्न कागजातहरु रुजू गरी स्वीकृत भएमा सामान्यतया बढीमा १ हप्ताभित्र त्यस्ता निवेदकहरुको प्रयोगात्मक परीक्षा लिइन्छ । पहिले कुनै सवारी चालक अनुमतिपत्र प्राप्त गरिसकेका व्यक्तिहरुले थप सवारीका लागि अनुमतित्र प्राप्त गर्न पुन लिखित परीक्षा दिनुपर्दैन¸ यस्ता निवेदकहरुको अनुमतिपत्र लिन चाहेको सवारीको परिक्षा समितिले तोके बमोजिमको स्थान, समय र मितिमा अन्तरवार्ता सहितको प्रयोगात्मक परीक्षा -ट्रायल) लिइन्छ । प्रयोगात्मक परिक्षास्थलमा परिक्षार्थीले सवारी साधन चलाउन सक्ने नसक्ने वारेमा प्रयोगात्मक विधिवाट परिक्षा लिईन्छ । यस गतिविधिलाई सम्बन्धित यातायात व्यवस्था कार्यालय तथा यातायात व्यवस्था विभागबाट समेत सिसिटिभी मार्फ अवलोकन गरि पारदर्शी परिक्षा प्रणाली अवलम्बन गरिन्छ ।\n" +
                "\n" +
                "सामान्यतया प्रयोगात्मक परीक्षा सम्पन्न भएको भोलीपल्ट सोको नतिजा कार्यालयको सूचनापाटीमा टाँस गरिनेछ । प्रयोगात्मक परीक्षामा उत्तिर्ण भएका निवेदकहरुलाई परीक्षाफल प्रकाशित भएको मितिले सामान्यतया बढीमा १ हप्ताभित्र सम्बन्धित फाँटवालाले कार्यालयमा राख्नुपर्ने रेकर्डहरु आफ्नो जिम्मामा सुरक्षित राखी नियमानुसार थप सवारी थप गरी चालक अनुमतिपत्र दिईने छ ।\n" +
                "\n" +
                "चालक अनुमतिपत्रमा अरू सवारी समावेश गर्न ठूला सवारीका लागि रु ५००/-, मझौला सवारीका लागि रु २५०/-, मोटर साइकल, स्कुटर बाहेकका साना सवारीका लागि रु १००/- र मोटरसाइकल, स्कुटरका लागि रु १००/- रहेको छ । तर एउटै चालक अनुमतिपत्रमा एक भन्दा बढी किसिमका सवारी चलाउने इजाजत पाएका हकमा सबैभन्दा बढी दस्तुर लाग्ने सवारीको दस्तुर मात्र लाग्नेछ ।");
        List<String> ChildDetails8 = new ArrayList<String>();
        ChildDetails8.add("शुरुमा प्रदान गरिने चालक अनुमतिपत्र एक वर्षो परीक्षण अवधिको लागि प्रदान गरिनेछ । परीक्षण अवधिमा ऐन, नियमावली विपरित कार्य पाँच पटकभन्दा बढी पटक गरेको प्रमाणित भएमा अधिकार प्राप्त अधिकारीले त्यस्तो चालकको चालक अनुमतिपत्र रद्द गर्न सक्नेछ । यसरी रद्द नभएको अवस्थामा उक्त अनुमतिपत्र स्वतः स्थायी भएको मानिनेछ ।  \n" +
                "चालक अनुमतिपत्रमा उल्लेखित उद्देश्य विपरित सवारी चालकले सवारी चलाएको पाइएमा त्यस्ता सवारी चालकको चालक अनुमतिपत्र अधिकारप्राप्त अधिकारीले पहिलो पटक तीन महिनाका लागि निलम्बन गर्न दोश्रो पटक ६ महिनासम्मका लागि निलम्बन र तेश्रो पटक भए खारेजसमेत गर्ने गरी निर्णय गर्न सक्नेछ । \n" +
                "सवारी चालक अनुमतिपत्र लिनका लागि अयोग्य भएको प्रमाणित भएमा अधिकारप्राप्त अधिकारीले त्यस्तो चालकको चालक अनुमतिपत्र खारेज गरी सो अनुमतिपत्र फिर्ता बुझाउन चालकलाई आदेश दिन सक्नेछ । यसरी आदेश प्राप्त भएको मितिले ७ दिनभित्र चालकले आफ्नोे अनुमतिपत्र अधिकारप्राप्त अधिकारीसमक्ष फिर्ता बुझाउनु पर्नेछ । \n" +
                "पाँच वर्षम्म पनि नवीकरण नगराएको चालक अनुमतिपत्र स्वतः रद्द हुनेछ र यस्तो अनुमतिपत्रको नवीकरण गरिने छैन । यसरी नवीकरण नभएको अनुमतिपत्रको लगत दर्ता किताबबाट कट्टा गरिनेछ ।");
        List<String> ChildDetails9 = new ArrayList<String>();
        ChildDetails9.add("चालक अनुमतिपत्रको म्याद नाघेको ३ महिनाभित्र चालक अनुमतिपत्र नवीकरण गर्राई सक्नु पर्दछ । यस्तो नवीकरण पाँच वर्ष लागि कायम रहनेछ । \n" +
                "नवीकरण गर्नका लागी सवारी चालक स्वयं उपस्थित भई नियमानुसार दस्तुर बुझाएको भौचरसहित रु. ५।- को टिकट टाँसी दरखास्त दिनु पर्नेछ ।  \n" +
                "यसरी दरखास्त दिंदा सवारी चालकले नेपल सरकारद्वारा मान्यताप्राप्त चिकित्सकबाट प्राप्त निरोगिताको प्रमाणपत्र पेश गर्नुपर्नेछ । \n" +
                "चालक अनुमतिपत्र नवीकरण गर्न आउने निवेदकहरुबाट नियमानुसार लाग्ने दस्तुरसहितको निवेदन प्राप्त भएपछि कार्यालय प्रमुख/ शाखा अधिकृतद्वारा निवेदन दर्ताका लागि सम्बन्धित फाँटमा पठाइने छ । सम्बन्धित फाँटवालाले निवेदन दर्ता गरी निवेदकलाई सवारी चालक अनुमतिपत्र नवीकरण गरिदिने मिति तोकी पठाइनेछ । \n" +
                "दर्ता निवेदनहरु आफ्नो कार्यालयबाटै जारी भएको चालक अनुमतिपत्रको हकमा ७ दिनभित्र र अन्य अञ्चलबाट जारी भएको चालक अनुमतिपत्रको हकमा १५ दिनभित्र नियमानुसार कार्यालयमा राख्नुपर्ने रेकर्डहरु राखी चालक अनुमतिपत्र नवीकरण गरी पठाइने छ । \n" +
                "पाँच वर्षम्म पनि नवीकरण नगराएको चालक अनुमतिपत्र स्वतः रद्द हुनेछ र यस्तो अनुमतिपत्रको नवीकरण गरिने छैन । यसरी नवीकरण नभएको अनुमतिपत्रको लगत दर्ता किताबबाट कट्टा गरिनेछ । \n" +
                "सवारी चालक अनुमतिपत्रको नवीकरण दस्तुरवापत ठूला सवारीका लागी रु २०००/-¸ मझौला सवारीका लागी रु १५००/-¸ मोटरसाइकल, स्कुटर बाहेकका साना सवारीका लागी रु १०००/- र मोटरसाइकल, स्कुटरका लागी रु ७००/- लाग्नेछ ।तर एउटै चालक अनुमतिपत्रमा एकभन्दा बढी किसिमका सवारी चलाउने इजाजत पाएका हकमा सबैभन्दा बढी दस्तुर लाग्ने सवारीको दस्तुर मात्र लाग्नेछ । \n" +
                "चालक अनुमतिपत्रको वहाल अवधि समाप्त भएको मितिले ३ महिनाभित्र पनि अनुमतिपत्र नवीकरण नगराएमा सो मिति समाप्त भएको एक वर्षसम्म १००%, दुइ वर्षसम्म २००%, तीन वर्षसम्म ३००%, चार वर्षसम्म ४००% र पाँच वर्षसम्म ५००% थप जरिवाना र दस्तुरसमेत लिई यस्तो चालक अनुमतिपत्र नवीकरण गरिनेछ ।");
        List<String> ChildDetails10 = new ArrayList<String>();
        ChildDetails10.add("चालक अनुमतिपत्र हराएमा, च्यातिएमा, झुत्रो भई नबुझिने भएमा वा कुनै कारणबाट नासिएमा सात दिनभित्र चालकले सम्बन्धित यातायात व्यवस्था कार्यालयमा अधिकारप्राप्त अधिकारीसमक्ष देहाय बमोजिमको दस्तुरसहित तोकिएको ढाँचामा दरखास्त दिनु पर्नेछ ।अनुमतिपत्र हराएकाको हकमा सम्बन्धित ट्राफिक प्रहरी कार्यालयको सिफारिसपत्रसमेत संलग्न गर्नुपर्नेछ ।\n" +
                "यसरी परेको दरखास्तमा कार्यालयले आवश्यक जाँचबुझ गरी दरखास्तवालाको मागबमोजिम अनुमतिपत्रको प्रतिलिपि दिई चालक अनुमतिपत्र दर्ता किताबमा सो व्यहोरा जनाइने छ । \n" +
                "प्रतिलिपिका लागि प्राप्त हुन आएका निवेदकहरु सम्बन्धित फाँटमा दर्ता भएपछि निवेदकलाई सामान्यतया ३ दिनभित्र प्रतिलिपि दिने गरी मिति तोकी पठाइने छ । \n" +
                "सवारी चालक अनुमतिपत्र प्रतिलिपि दस्तुर वापत रु १००/- (ठूला सवारी¸ मझौला सवारी¸ मोटरसाइकल, स्कुटर बाहेकका साना सवारी र मोटरसाइकल, स्कुटर लगायत सवैका लागी) लाग्नेछ ।");
        List<String> ChildDetails11= new ArrayList<String>();
        ChildDetails11.add("नेपालभरबाट जारी हुने सवारी चालक अनुमतिपत्रहरु पहिचानका लागि चालक अनुमतिपत्रको नम्बरको अगाडि निम्नानुसार अन्चल कार्यालयहरुबाट जारी अनुमतिपत्रमा निम्नानुसारका कोड नं. समेत रहने गरी कम्तिमा ६ अङ्कको नम्बर हुने गरी सवारी चालक अनुमतिपत्र नम्बरहरु रहेका छन् ।\n" +
                "\n" +
                "मेची - ०१¸ कोशी - ०२¸ सगरमाथा -०३¸जनकपुर -०४¸ नारायणी -०५¸ बागमती -०६¸ लुम्बिनी-०७¸ गण्डकी -०८¸ धौलागिरी -१३ ¸राप्ती -०९¸ भेरी -१०¸ सेती -११¸ महाकाली -१२\n" +
                "\n" +
                "साविकमा प्रहरी निकायले प्रदान गरेको चालक अनुमतिपत्र नवीकरण गर्दा पुरानो चालक अनुमतिपत्र खिचि सोको सट्टा अञ्चल कोड नम्बर पछि ५००००० नम्बरबाट शुरु हुने गरी नयाँ नम्वर प्रदान गरी नवीकरण गरीदिइएको छ । यसरी नवीकरण गर्दा नयाँ नम्बरका पछि कोष्टमा साविक प्रहरी निकायबाट प्रदान भएको नम्बर समेत उल्लेख भएको छ ।");

        HeaderDetails.put("-> सवारी चालक अनुमतिपत्र प्राप्त गर्नका लागि दरखास्त दिने व्यक्तिको योग्यता के हुनु पर्दछ ?", ChildDetails1);
        HeaderDetails.put("->  सवारी चालक अनुमतिपत्र लिनका लागि के के कागजपत्रहरु संलग्न गरी कसरी दरखास्त दिने ?", ChildDetails2);
        HeaderDetails.put("->  यातायात व्यवस्था कार्यालयहरुमा सवारी चालक अनुमतिपत्रको दरखास्त फारामहरु कसरी छानविन र स्वीकृत गरिन्छ ?", ChildDetails3);
        HeaderDetails.put("->  चालक अनुमतिपत्रको लिखित परीक्षाको संचालन कसरी गरिन्छ ? तथा परिक्षाका बारेमा आधारभुत जानकारी ।", ChildDetails4);
        HeaderDetails.put("->  सवारी चालक अनुमतिपत्रको लिखित परिक्षाको उत्तर पुस्तिका परीक्षण तथा नजिता प्रकाशन के कसरी गरिन्छ ?", ChildDetails5);
        HeaderDetails.put("->  अन्तर्वार्ता सहितको प्रयोगात्मक परीक्षा (ट्रायल) भनेको के हो ? यो कसरी कहाँ लिईन्छ र अन्तिम नतिजा प्रकाशन कसरी गरिन्छ ?", ChildDetails6);
        HeaderDetails.put("->  चालक अनुमतिपत्रमा अरू सवारी थप समावेश गर्न के गर्नु पर्छ ? के कति शुल्क लाग्छ ?", ChildDetails7);
        HeaderDetails.put("->   सवारी चालक अनुमतिपत्रमा कारवाही र खारेजी के कसरी हुन्छ ?", ChildDetails8);
        HeaderDetails.put("->   चालक अनुमतिपत्रको नवीकरण कहिले गर्नुपर्छ शुल्क जरिवाना के कति लाग्छ ?", ChildDetails9);
        HeaderDetails.put("->  चालक अनुमतिपत्रको प्रतिलिपि लिन के गर्नु पर्छ ? के कस्तो अवस्थामा कसरी लिन सकिन्छ¸ शुल्क र समय के कति लाग्छ ?", ChildDetails10);
        HeaderDetails.put("->  नेपालभरवाट जारी भएका चालक अनुमतिपत्रहरुमा रहेका नम्बरका आधारमा कुन अन्चलवाट जारी भएको हो भनी कसरी चिन्न सकिन्छ ?", ChildDetails11);

        return HeaderDetails;
    }
}
