package com.android.www.DrivingLicenseTest.question;

/**
 * Created by AKShrestha on 3/1/2017.
 */


import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

import java.util.ArrayList;
import java.util.List;


public class Health extends SQLiteOpenHelper {
    private static final int DATABASE_VERSION = 2;
    // Database Name
    private static final String DATABASE_NAME = "Ku";
    // tasks table name
    private static final String TABLE_QUEST = "questi";
    // tasks Table Columns names
    private static final String KEY_ID = "qid";
    private static final String KEY_QUES = "question";
    private static final String KEY_ANSWER = "answer"; // correct option
    private static final String KEY_OPTA = "opta"; // option a
    private static final String KEY_OPTB = "optb"; // option b
    private static final String KEY_OPTC = "optc"; // option c
    private static final String KEY_OPTD = "optd";//option d
    private SQLiteDatabase dbase;
    public Health(Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }
    @Override
    public void onCreate(SQLiteDatabase db) {
        dbase = db;
        String sql = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST + " ( "
                + KEY_ID + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES
                + " TEXT, " + KEY_ANSWER + " TEXT, " + KEY_OPTA + " TEXT, "
                + KEY_OPTB + " TEXT, " + KEY_OPTC + " TEXT, " + KEY_OPTD + " TEXT )";
        db.execSQL(sql);
        addQuestion();
// db.close();
    }
        private void addQuestion() {
            Question q1 = new Question("उकालोमा कताबाट आउने सभारी साधनलाई पहिला प्राथमिकता दिनुपर्दछ?", "दुबैले बराबर", "ओरालोबाट उकालोतर्फ आउनलाई", "ओरालोबाट उकालोतर्फजानेलाई","कसैले नि पर्दैन", "ओरालोबाट उकालोतर्फ आउनलाई");
            this.addQuestion(q1);
            Question q2 = new Question("हेडलाइटमा कति बिमहरु हुन्छन?", "४" ,"१", "२", "३", "२");
            this.addQuestion(q2);
            Question q3 = new Question("सवारी प्रदूषण मापदण्ड कैले बाट लागू भयको हो?", "२०४९ ", "२०५४ ","२०७०", "२०५६", "२०५६");
            this.addQuestion(q3);
            Question q4 = new Question("ब्रेकको काम के हो ?", "गाडी रोकने", "गाडी स्लो गर्नी ", "बत्ति बाल्ने  ",  "कुनै पनि हैन ", "गाडी रोकने");
            this.addQuestion(q4);
            Question q5 = new Question("ठुलो सभारी साधनको वजन कति हुन्छ ?", "८ टन ", "१५ टन ", "१० टन ", "१० टनभन्दा बढी", "१० टनभन्दा बढी");
            this.addQuestion(q5);
            Question q6 = new Question("ब्रेक कति किसिमका हुन्छ ?", "१", "२", "४", "३", "३");
            this.addQuestion(q6);
            Question q7 = new Question("मोटरसाइकल कन्ट्रोल गर्ने कुनै चार कुरा लेख्नुहोस्?", "फूट ब्रेक, क्लच, ह्यन्ड ब्रेक, गियर", "फूट ब्रेक, क्लच, ह्यन्ड ब्रेक, एक्सेलेटर", " फूटब्रेक, ह्यन्ड ब्रेक, गियर, एक्सेलेटेर", "फूट ब्रेक, क्लच, ह्यन्ड ब्रेक, ह्यन्ड्ल", "फूट ब्रेक, क्लच, ह्यन्ड ब्रेक, एक्सेलेटर");
            this.addQuestion(q7);
            Question q8 = new Question("जेब्रा  क्रोस्स्मा ....... ?", "ओभरटेक  गर्नी ", "गाडी स्लो गर्नी", "हेटलाइट बाल्ने", " कुनै पनि हैन ", "गाडी स्लो गर्नी");
            this.addQuestion(q8);
            Question q9 = new Question("तलको कुन गियर बडी सक्तिशाली हुन्छ?", "१ न गियर", "२ न गियर", "३ न गियर", "४ न गियर", "१ न गियर");
            this.addQuestion(q9);
            Question q10 = new Question("बिग्रको सभारी चलायमा के हुन्छ?", "केहि पनि हुदैन ", "खतरा", "ट्राफिकले समत्चा ", "माथि को सबै", "खतरा");
            this.addQuestion(q10);
            Question q11 = new Question("दमकल आएको बेला आफ्नो सवारीलाई के गर्नुपर्दछ?", "स्पीड घटाउने","स्पीड बडाउने", "गाडी सडकको बिच भागमा लैजाने", "गाडीको गति कम गरी साइड दिने", "गाडीको गति कम गरी साइड दिने");
            this.addQuestion(q11);
            Question q12 = new Question("कोसंग सभारी चलाउदा बडी सतर्क हुनुपर्छ?", "कर्मचारी र महिला", "बालक र बृद्धहरु"," ट्राफिक संग", "शिक्षक र विर्धर्थीहरु ", "बालक र बृद्धहरु");
            this.addQuestion(q12);
            Question q13 = new Question("मोटरसाइकल को धूवा कहाँ चेक गरिन्छ?", "वक्सप", "जहाँ गरेनि हुन्छ", "यातायात कायालय", "काहीँ  पनि गराइदैन", "काहीँ  पनि गराइदैन");
            this.addQuestion(q13);
            Question q14 = new Question("गति ० रेखाले के गर्नी संकेत गर्छ?", "गाडी कम गतिमा पार्ने", "गाडी फर्काउने", "गाडी रोक्ने", "कुनै पनि हैन", "गाडी रोक्ने");
            this.addQuestion(q14);
            Question q15 = new Question("बा १ झ नम्बर प्लेट राखिएको सवारी कस्तो प्रकारको सवारी हो?", "सरकारी टेम्पो", "निजी टेम्पो", "निजी गाडी", "सार्वजनिक टेम्पो", "सरकारी टेम्पो");
            this.addQuestion(q15);
            Question q16 = new Question("नेपालमा भएको पिच सडकले कति टनसम्म धानना  सक्ने छ्यमता छ?", "८ टन", "१० टन", "१८ टन", "१२ टन", "१० टन");
            this.addQuestion(q16);
            Question q17 = new Question("उपत्यका काठमाडौँ कुन इन्धनबाट संचालित सवारी ट्याकासीका रुपमा ल्याउन पाउदैन?", "विधुत्", "पेट्रोल", "डिजेल", "सबै पाउछ", "डिजेल");
            this.addQuestion(q17);
            Question q18 = new Question("सवारी प्रदुषण नियम कुनकुन ठाउँमा लागू भएको छ?", "काठमाडौँमा", "काठमाडौँ र पोखरामा", "नेपाल आधिराज्यभर", "पोखरामा", "काठमाडौँमा");
            this.addQuestion(q18);
            Question q19 = new Question("सवारी प्रवेश कहाँ गराउनुपर्छ?", "नजिकको प्रहरी कार्यालय", "कुनै पनि हैन", "यातायात कार्यालय", "यातायात व्यबस्था वीभागा ", "नजिकको प्रहरी कार्यालय");
            this.addQuestion(q19);
            Question q20 = new Question("टर्निङ गरिसकेपछी साइड लाईट बन्द गर्न बिर्स्यो भने के हुन सक्छ ?", "पछाडिको चालकहरुले ब्रेक लाईट ख्याल नगरर्नसक्छन", "गाडीको ब्याट्री चाडो सिद्दिन्छ ", "पछाडिको चालकहरु अलमलिन सक्छ र गाडी ठोकिन सक्छ", " माथिको सबै ", "पछाडिको चालकहरु अलमलिन सक्छ र गाडी ठोकिन सक्छ");
            this.addQuestion(q20);
            Question q21 = new Question("सवारी ढुर्घटना के के कारणले हुने गर्दछ ?", " कडा औषधी सेवन गरी सवारी चलाएमा ", "बाटोको अवस्था बिपरित तिब्र गतिमा सवारी चलाएमा ", "जु निद्रा, थकान लागेको बेला सवारी चलएमा", "माथिको सबै", "माथिको सबै");
            this.addQuestion(q21);
            Question q22 = new Question("उकालो कुन गियरमा चलाऊनु पर्दछ ?", "पहिलो गेयर", "सेकेन्ड गेयर ", "जुनमा आइरहेको छ त्यसैमा", "माथिको सब वकबास ", "पहिलो गेयर");
            this.addQuestion(q22);
            Question q23 = new Question("सडको बिचमा राखेको नक्साले के जनाउछ?", "लेन मिलाउनु", "गाडी सिधै चलाउनु", "गाडी साइड लगाउनु", "कुनै हैन", "गाडी सिधै चलाउनु");
            this.addQuestion(q23);
            Question q24 = new Question("लाइसेनस लिन पाउने सबैभन्दा कम उमेर कति हो ?", "१४ वर्ष", "१६ वर्ष", "१७ वर्ष", "१८ वर्ष", "१८ वर्ष");
            this.addQuestion(q24);
            Question q25 = new Question("कार्बूरेटरमा इन्धनको मात्रा बदाउनेलाई के भनिन्छ ?", "चोक", "चोक र ए.सी. पाइप", "ए.सी. पाइप", "कुनै पनि हैन", "चोक");
            this.addQuestion(q25);
            Question q26 = new Question("ओरालोमा गाडी कुन गियारमा राख्नु राम्रो हो ?", "१ नम्बर ", "२ नम्बर ", "३ नम्बर ", "ब्याक गियार", "ब्याक गियार");
            this.addQuestion(q26);
            Question q27 = new Question("तीव्र गतिको गाडी के गर्दा बडी खतरा हुन्छ ?", "एक्कासि मोड्दा", "रोक्दा", "एक्कासि रोक्दा ", "कुनै पनि हैन", "एक्कासि मोड्दा");
            this.addQuestion(q27);
            Question q28 = new Question("ओभरटेक गर्दा आगाडिको गाडीलाई कसरी संखेत दिने ?", "हेडलाइट बालेर", "हर्न बजाएर र हेडलाइट बालेर","हर्न बजाएर", "स्लोडउनको इसारा दिएर", "हर्न बजाएर");
            this.addQuestion(q28);
            Question q29 = new Question("सडकको लाइट सिगनलमा रातो बत्तीले के जनाउँछ ?", "होसियार", "सवारी रोक्ने", "बिस्तारै हाक्ने ", "रोक हेर र जाऊ", "सवारी रोक्ने");
            this.addQuestion(q29);
            Question q30 = new Question("कस्तो रोग भएको मानिस ले आनुमिति पत्र पाउन सक्दैन?", "छारे रोग ", "रतन्धो ", "माथिका सबै", "कुनै पनि हैन", "माथिका सबै");
            this.addQuestion(q30);
            Question q31 = new Question("टाइरडको कम के हो ?", "चालकलाई सतर्क गराउनु", "चक्कालाई दायाँ र बायाँ गर्नु", " चक्कालाई घुमाउने", "इन्जिनलाई चिसो पार्नु", "चक्कालाई दायाँ र बायाँ गर्नु");
            this.addQuestion(q31);
            Question q32 = new Question("पिकअपले कति टन सम्म भारबहन गर्न पाउछ ?", "६ टन", "५ टन", "१ टन", "४ टन", "१ टन");
            this.addQuestion(q32);
            Question q33 = new Question("मोटरसाइकलमा कति सिट संख्या हुन्छ ?", "१", "२", "६", "३", "२");
            this.addQuestion(q33);
            Question q34 = new Question("ब्रेक आयल कहाँ राख्नुपर्छ?", "रेडियटर", "मास्टर सिलीनडरमा", "कार्बुलेटर", "सिलीनडरमा", "मास्टर सिलीनडरमा");
            this.addQuestion(q34);
            Question q35 = new Question("छोटो बाटो .......?", "२५ देखि १०० कि.मि.", "२५ देखि १०० कि.मि.",  "५० देखि १०० कि.मि.", "७५ देखि १०० कि.मि.", "२५ देखि १०० कि.मि.");
            this.addQuestion(q35);
            Question q36 = new Question("संसारमा सबै भन्दा पैला ट्राफिक लाइटको कुन देशमा सुरु भएको हो  ?", "रुस", "बेलायत", "जर्मनी", "नेपाल", "बेलायत");
            this.addQuestion(q36);
            Question q37 = new Question("सडकमा सवारी दुर्घटना घटाउनके गर्न पर्छ ?", "ओभरटेक गर्न हुदैन", "सडक नियम पालना गर्नुपर्छ", "सवारी विस्तारै चलाउनुपर्छ", "कुनै पनि हैन", "सडक नियम पालना गर्नुपर्छ");
            this.addQuestion(q37);
            Question q38 = new Question("लाइसेनस लिन पाउने सबैभन्दा कम उमेर कति हो ?", "१४ वर्ष", "१६ वर्ष", "१८ वर्ष", "१७ वर्ष", "१८ वर्ष");
            this.addQuestion(q38);
            Question q39  = new Question("सबारी चालक अनुमति पत्रको नवीकरण कहिले हुनुपर्छ?", "प्रत्येक वर्ष", "२ बर्षमा", "३ बर्षमा", "५ बर्षमा", "५ बर्षमा");
            this.addQuestion(q39);
            Question q40 = new Question("ओरालोमा गाडी कुन गियारमा राख्नु राम्रो हो ?", "१ नम्बर", "२ नम्बर", "३ नम्बर ", "ब्याक गियार", "ब्याक गियार");
            this.addQuestion(q40);
            Question q41 = new Question("कुन सबारीले बाटो इजाजत पत्र लिनु पर्छ?", "सरकारी", "सार्बजनिक", "निजी", "सबैले", "सार्बजनिक");
            this.addQuestion(q41);
            Question q42 = new Question("ट्रली बस के ले चल्छ ?", "डिजेल", "पेट्रोल", "विधूत", "कुनै पनि हैन", "विधूत");
            this.addQuestion(q42);
            Question q43 = new Question("पहेलो प्लेट गाडी कुन संस्था को हुन्छ ?", "मन्त्रालयको ", "व्यक्तिगत ", "संस्थानको", "इम्बेसीहरुको", "संस्थानको");
            this.addQuestion(q43);
            Question q44 = new Question("मोटर चद्ने पहिलो पहिलो नेपाली को हुन?", "चन्द्र शमशेर", "वीर शमशेर", "देव शमशेर", "कुनै पनि हैन", "वीर शमशेर");
            this.addQuestion(q44);
            Question q45 = new Question("म्याद समाप्त भएको मितिले कति वर्षाभित्र नबिकरण नगराएमा सवारी चालक आनुमतिपत्र रद्ध हुने ब्यवस्था छ ?", "२ वर्षा", "१ वर्षा", "३ वर्षा", "५ वर्षा", "५ वर्षा");
            this.addQuestion(q45);
            Question q46 = new Question("नेपालमा सडकमा कुन साइटबाट चलाउनुपर्छ  ?", "बायाँ बाट", "दायाँ बाट", "बिच बाट", "कुनै पनि हैन", "बायाँ बाट");
            this.addQuestion(q46);
            Question q47 = new Question("कार्बुरेटर कुन इन्जिनमा हुन्छ?", "डिजेल इन्जिन", "पेट्रोल इन्जिन", "ग्यास इन्जिन", "सबैमा हुन्छ", "पेट्रोल इन्जिन");
            this.addQuestion(q47);
            Question q48 = new Question("बा १ स  कुन सवारी साधन हो?", "निजी टेम्पो","निजी TAXI",  "निजी कार", "निजी मोटर साइकल", "निजी टेम्पो");
            this.addQuestion(q48);
            Question q49 = new Question("पहेंलो नम्बर प्लेटले कुन सबारीलाई जनाउँछ?", "संस्थानको", "ट्राफिकको", "निजी कारको", "पर्यटनको", "संस्थानको");
            this.addQuestion(q49);
            Question q50 = new Question("सवारी चलाउँदा के सेवन हुदैन?", "लागू औषध", "मदिरा सेवन", "चुरोट", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q50);
            Question q51 = new Question("L अक्षर लेखिएको सवारी कस्तो सवारी हुन्?", "सिकारु सवारी", "संग्थानको सवारी","संस्थानको",  "कुटनैतिक नियोगका सवारी", "सिकारु सवारी");
            this.addQuestion(q51);
            Question q52 = new Question("इन्जिनमा के राखिन्छ?", "पनि", "ब्रेक आयल", "इन्जिन आयल", "डिजेल आयल", "इन्जिन आयल");
            this.addQuestion(q52);
            Question q53 = new Question("आफ्नो लेनमा सवारी हिँडाउन नसक्दा के हुन्छ?", "पैदल यात्रीलाई बाधा पर्छ", "धुर्घटना हुन्छ", "केहि हुँदैन", "आरू लाई गारो हुन्छ", "धुर्घटना हुन्छ");
            this.addQuestion(q53);
            Question q54 = new Question("सवारी साधन मध्ये सबैभन्दा असुरक्षित कुन हो?", "TAXI", "माइक्रोबस", "टयाक्टर", "मोटरसाइकल", "मोटरसाइकल");
            this.addQuestion(q54);
            Question q55 = new Question("बाक्लो बस्ती भएको इलाकामा सवारीको गति कति हुनुपर्छ?", "७० कि.मि.", "५० कि.मि.", "४० कि.मि.", "६० कि.मि.", "४० कि.मि.");
            this.addQuestion(q55);
            Question q56 = new Question("सी.सी. भन्नाले के बुझाँछ?", "इन्जिनको क्षमाता", "गियर बाक्सको क्षमाता", "रेडियटर को क्षमाता", "कुनै पनि हैन", "इन्जिनको क्षमाता");
            this.addQuestion(q56);
            Question q57 = new Question("साधारण धुर्घटना हुन परस्थितिहरु के के हुन् ?", "चालकको गल्तीले", "पैदल यात्रीको गल्तीले", "लेनमा सवारी नचलाउदा", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q57);
            Question q58 = new Question("इमर्जेन्सी लाइट कुन  समयमा बाल्नुपर्छ?", "ओभरटेक गर्नी ", "बिरामी बोकेको आवस्थामा", "हतार भएको बेलामा", "माथिको सबै", "बिरामी बोकेको आवस्थामा");
            this.addQuestion(q58);
            Question q59 = new Question("यातायात निरीक्षकको नियुति कोसले गर्ने गरेको हुन्छ?", "नेपाल सरकार", "ट्राफिक कार्याले", "यातायात व्यवस्था विभागले", "CDO कार्याले", "नेपाल सरकार");
            this.addQuestion(q59);
            Question q60 = new Question("सार्वजनिक सबरीको भाडा कसले निधारण गर्दछ?","नेपाल सरकार", "ट्राफिक कार्याले", "यातायात व्यवस्था विभागले", "CDO  कार्याले", "यातायात व्यवस्था विभागले");
            this.addQuestion(q60);
            Question q61 = new Question("नेपालको कुन सवारी साधनमा प्रदूषण जाँच गरिदैन?", "एम्बुलेन्स र शव बहान", "डोजर तथा लोडर", "सरकारी सबारीको", "सबैमा गरिन्छ",  "डोजर तथा लोडर");
            this.addQuestion(q61);
            Question q62 = new Question("क्लचले कहाँ काम गर्छ?", "चक्कामा", "इन्जिनमा र गियर बक्समा", "ब्याट्रीमा", "माथिका सबै", "इन्जिनमा र गियर बक्समा");
            this.addQuestion(q62);
            Question q63 = new Question("खारेज भएको चालकको अनुमतिपत्र कति दिनभित्र फिर्ता बुझाउनुपर्छ?", "७", "१०", "१५", "३० ", "७");
            this.addQuestion(q63);
            Question q64 = new Question("चालक अनुमतिपत्र के गर्दा स्वत:रद्द हुन्छ?", "म्याद नाघेको २ वर्षा", "म्याद नाघेको ४ वर्षा", "म्याद नाघेको ३ वर्षा", "म्याद नाघेको ५ वर्षा", "म्याद नाघेको ५ वर्षा");
            this.addQuestion(q64);
            Question q65 = new Question("एक्सिलेटर धेरै थिचे के हुन्छ?", "गति रोकिन्छ", "गति बद्छ", "गति मन्द हुन्छ", "केहि हुदैन", "गति बद्छ");
            this.addQuestion(q65);
            Question q66 = new Question("टायरमा हावा बडी भएमा के हुन सक्छ?", "स्पिड कम लिन्छ", "स्पिड बडी लिन्छ", "पंन्चर हुन सक्छ", "केहि हुदैन", "पंन्चर हुन सक्छ");
            this.addQuestion(q66);
            Question q67 = new Question("कुन सवारीमा ब्रेक आयाल आवश्यकता पर्दैन?", "हाइड्रोलिक ब्रेक भयको", "ऐयर ब्रेक भयको", "मेकानिकल ब्रेक भयको", "माथिका सबै", "हाइड्रोलिक ब्रेक भयको");
            this.addQuestion(q67);
            Question q68 = new Question("कताको टायरमा हावा बडी राख्न्नुपर्छ?", "आगदिको", "पछाडिको", "सबै बराबर", "माथिका सबै", "पछाडिको");
            this.addQuestion(q68);
            Question q69 = new Question("गोलो आकारको ट्राफिक चिन्हले के बुझाउँछ?", "आदेशमुलक", "सचेतात्मक", "सूचनामूलक", "प्रतिबन्धात्मक", "प्रतिबन्धात्मक");
            this.addQuestion(q69);
            Question q70 = new Question("परिचालकको कति रकम बिमा गरिएको हुनुपर्छ?", "रु ५००००", "रु १०००००", "रु ५०००००", "रु १५०००००", "रु ५०००००");
            this.addQuestion(q70);
            Question q71 = new Question("बाटोको इजाजतापत्र कस्तो सबरिले लिनुपर्छ?", "सरकारी", "भाडाको", "निजी", "सबैले", "भाडाको");
            this.addQuestion(q71);
            Question q72 = new Question("कुन सवारी साधनमा ब्याक गियर हुदैन?", "टेम्पो", "मोटरसाइकल", "ट्याक्सी", "कार को ", "मोटरसाइकल");
            this.addQuestion(q72);
            Question q73 = new Question("ओभरटके गर्दा कुन गियर लगाउनुपर्छ?", "१", "३",  "५", "उपयुत गियर", "उपयुत गियर");
            this.addQuestion(q73);
            Question q74 = new Question("गाडीमा कुन कुन कुरा हुनु हुदैन?", "फोरमैला", "खिया लागेको", "बिग्रको", "माथिक सबै", "माथिक सबै");
            this.addQuestion(q74);
            Question q75 = new Question("सवारी तथा यातायात व्यवस्था नियमावलीको जारी मिति?", "२०४९/१/१२", "२०५५/१/१२", "२०४५/३/१२", "२०६०/४/१२", "२०४५/३/१२");
            this.addQuestion(q75);
            Question q76 = new Question("सवारी तथा यातायात व्यवस्था ऐन कहिले जारी भएको हो?", "२०४८/९/५", "२०४९/९/२२", " २०४८/९/५", "२०५२/११/११", "२०४९/९/२२");
            this.addQuestion(q76);
            Question q77 = new Question("गियर किन बदलि रहनुपर्छ?", "स्पिड बडाउन", "स्पिड घटाउन", "स्पिड घटाउन र बडाउन", "कुनै पनि हैन", "स्पिड घटाउन र बडाउन");
            this.addQuestion(q77);
            Question q78 = new Question("टंकीमा भएको इन्धन तानेर कार्बुरेटर लाई दिन काम कसले गर्दछ?", "चोकले", "बुसले", "सप्लाई पम्प", "ए.सी. पम्प", "ए.सी. पम्प");
            this.addQuestion(q78);
            Question q79 = new Question("डिफेनास्लाको काम के हो?", "चक्का घुमाउने", "ब्रेकलाई बलियो बनाउने", "ब्याट्रीलाई ओभरचार्जा हुनबाट बचाउँछ", "माथिको सबै", "चक्का घुमाउने");
            this.addQuestion(q79);
            Question q80 = new Question("सुरक्षित तथा इन्धन खपतको हिसाबले सवारीमा कति स्पिड हुनुपर्छ?", "०-३०कि.मि.", "४०-६०कि.मि.", "६०-८०कि.मि.", "३०-४०कि.मि.", "४०-६०कि.मि.");
            this.addQuestion(q80);
            Question q81 = new Question("सार्वजनिक सबरिभित्र कसले धूम्रपान गर्न पाउँछ?", "सवारी चालकले", "परिचालकले","सबैले पाउँछ", "कसैले पनि पाउँदैन", "कसैले पनि पाउँदैन");
            this.addQuestion(q81);
            Question q82 = new Question("यीमध्ये ठुलो सवारी भन्नाले कुन कुन सवारी पर्दछन्?", "बस,डोजर", "मिनीबस,रोलर", "रल", "भ्यान,जीप", "बस,डोजर");
            this.addQuestion(q82);
            Question q83 = new Question("VIP को गाडी आउँदा के गर्नुपर्छ?", "आफ्नो लेनमा हिडने", "साइड दिने", "केहि पनि नगर्ने","माथिका सबै", "साइड दिने");
            this.addQuestion(q83);
            Question q84 = new Question("सवारी पार्किंङ कहाँ गर्नुपर्छ?", "P लेखिएको ठाउँमा", "बस स्टेसनमा", "जहाँ आफुलाई आवश्यक पर्छ त्यहीँ", "माथिका सबै", "P लेखिएको ठाउँमा");
            this.addQuestion(q84);
            Question q85 = new Question("पर्यटन सवारी भनेको कस्तो सवारी हो?", "विदेशी पर्यटकलाई", "नेपाली पर्यटकलाई", "नेपाली र विदेशी", "मथिका सबै", "विदेशी पर्यटकलाई");
            this.addQuestion(q85);
            Question q86 = new Question("सवारी दर्ता कति समयभित्र गरिसक्नुपर्छ?", "१५ दिन", "२० दिन", "३० दिन", "४५ दिन", "१५ दिन");
            this.addQuestion(q86);
            Question q87 = new Question("स्कुल क्षेत्रमा हर्न बजाउनु हुन्छ?", "आफ्नो इच्छा ", "कहिलेकहिँ हुन्छ", "हुँदैन", "माथिको सबै", "हुँदैन");
            this.addQuestion(q87);
            Question q88 = new Question("पावर टिलरको कतिसम्म भारवहन गर्ने सक्ने  क्षमता तोकिएको छ?", "१ टन ", "२ टन","४ टन ", "३ टन", "१ टन");
            this.addQuestion(q88);
            Question q89 = new Question("आनुमति नलिई विदेशी सवारी नेपालभित्र चलाएमा के हुन सक्छ?", "१ वर्षा सम्म कैद", "३ वर्षा सम्म कैद", "रु १००० देखि रु ५००० सम्म जरिवाना", "६ महिना सम्म कैद", "रु १००० देखि रु ५००० सम्म जरिवाना");
            this.addQuestion(q89);
            Question q90 = new Question("स्कुटर बढीमा सवारी गति कतिसम्म हुनु पर्छ?", "३०कि.मि.", "४०कि.मि.", "५०कि.मि.", "६०कि.मि.", "४०कि.मि.");
            this.addQuestion(q90);
            Question q91 = new Question("ब्याट्री कति किसिमका हुन्छन्?", "१ किसिम", "२ किसिम", "३ किसिम", "४ किसिम", "१ किसिम");
            this.addQuestion(q91);
            Question q92 = new Question("मेची महाकाली जोड्ने राजमार्ग कुन हो?", "महिन्द्र राजमार्ग", "अरनिको राजमार्ग", "त्रिभुबन राजमार्ग", "कालुपान्डे ", "महिन्द्र राजमार्ग");
            this.addQuestion(q92);
            Question q93 = new Question("रातको समयामा ओभरटेक गर्दा के गर्नु पर्छ?", "हर्न बजाउने", "इन्डिकेटर बाल्ने", "हेडलाइट डिम गर्ने", "माथिका सबै", "हेडलाइट डिम गर्ने");
            this.addQuestion(q93);
            Question q94 = new Question("सेतो नम्बर प्लेटले कुन सवारी  जनाउँछ?", "सरकारी गाडी", "निजी गाडी", "भाडाको गाडी", "पर्यटक गाडी", "सरकारी गाडी");
            this.addQuestion(q94);
            Question q95 = new Question("मोटरसाइकलको हेन्ड ब्रेक कुन चक्कामा लाग्दछ?", "पछाडी", "अगाडिको", "अघिपछि दुवै चक्कामा", "माथिका सबै", "अगाडिको");
            this.addQuestion(q95);
            Question q96 = new Question("सवारी दुर्घटनाबाट मित्यु भएको कति दिन भित्रमा विमा रकम पाइन्छ?", "१५ दिन", "७ दिन", "२५ दिन", "३५ दिन", "२५ दिन");
            this.addQuestion(q96);
            Question q97 = new Question("सानो सभारी साधन तलको मध्ये कुन हैन?", "कार", "जिप", "TAXI", "टोलर", "टोलर");
            this.addQuestion(q97);
            Question q98 = new Question("मोटरसाइकल चलाउँदा के अनिवार्य  छ?", "हेलमेट लगाउन", "चस्मा लगाउन", "ज्याकेट लगाउन", "माथिका सबै", "हेलमेट लगाउन");
            this.addQuestion(q98);
            Question q99 = new Question("इन्जिनलाई चिस्याउन पानी राख्ने उपकरलाई के भनिन्छ?", "डायनामो", "कुलर", "रेडियटर", "एसी", "रेडियटर");
            this.addQuestion(q99);
            Question q100 = new Question("सार्वजनिक सवारीमा प्रदुषण स्टिकारको म्याद कति अबधिको हुन्छ?", "२ महिना", "१२ महिना", "३ महिना", "६ महिना ", "१२ महिना");
            this.addQuestion(q100);
            Question q101 = new Question("पानी परेको बेला अगाडी केहि नदेखिएमा के गर्ने?", "रुमालले पुछ्ने", "वईफर चलाउने", "गाडी रोक्ने", "गाडीको स्पिड बढाउने", "वईफर चलाउने");
            this.addQuestion(q101);
            Question q102 = new Question("स्पार्क प्लगको काम के हो?", "इन्जिन तताउने", "मोबिल तताउने", "इन्जिनमा आगोको झिल्का दिने", "माथिका कुनै पनि हैन", "इन्जिनमा आगोको झिल्का दिने");
            this.addQuestion(q102);
            Question q103 = new Question("ट्राफिक लाइट कुन संस्थाले सडकमा राखने काम गर्छ?", "सडक बिभाग", "दूरसंचार", "नगरपालिक", "माथिका कुनै पनि हैन", "सडक बिभाग");
            this.addQuestion(q103);
            Question q104 = new Question("ब्याट्रीलाई ओभरचार्जा हुनबाट के ले बचाउँछ?", "रोटर", "कट आउट", "एयर कुलर", "कुनै पनि हैन", "कट आउट");
            this.addQuestion(q104);
            Question q105 = new Question("सवारी साधनको सबैभन्दा महात्वपूर्ण लाइट कुन हो?", "साइड लाइट ", "ब्याक लाइट", "हेड लाइट", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q105);
            Question q106 = new Question("तीब्र गतिको गाडी के गर्दा बढी खतरा हुन्छ?", "एक्कासी मोड्दा", "रोक्दा", "गिएर बदल्दा",  "झ्याप्प ब्रेक लगाउदा", "एक्कासी मोड्दा");
            this.addQuestion(q106);
            Question q107 = new Question("ओभरटेक गर्दा अगाडिको सबरीलाई कसरी संकेत दिने?", "हेडलाईट बालेर", "हातको इशाराले", "हर्न बजाएर","स्लोडाउनको इशाराले", "हर्न बजाएर");
            this.addQuestion(q107);
            Question q108 = new Question("ट्राफिक लाइट सिग्नलमा कति किसमका बत्तीहरु हुन्छन?", "२ किसिमका", "३ किसिमका", "१ किसिमका", "४ किसिमका", "३ किसिमका");
            this.addQuestion(q108);
            Question q109 = new Question("ब्रेक कुन आवस्थामा निष्कृय हुन सक्छ?", "उकालोमा गियर अप पर्दा ", "बिस्तारै चलाउँदा", "ओरालोमा न्यूट्रलमा चलाउँदा", "स्पीडमा चलाउँदा", "ओरालोमा न्यूट्रलमा चलाउँदा");
            this.addQuestion(q109);
            Question q110 = new Question("स्पिड़ो मिटरले सवारीको के देखाउँछ?", "पेट्रोलको मात्रै", "डिजेलको मात्रै", "सबारिको गति", "कुनै पनि हैन", "सबारिको गति");
            this.addQuestion(q110);
            Question q111 = new Question("गाडीको ह्यान्ड ब्रेक कुन चक्कामा लाग्छ?", "सबै चक्कामा", "अगाडीका दुइ चक्कामा", "पछाडिका दुइ चक्कामा", "सबै चक्कामा लाग्दैन", "पछाडिका दुइ चक्कामा");
            this.addQuestion(q111);
            Question q112 = new Question("ठुलो सबारी भन्नाले तलका मध्य कुनलाई बुझाउछ?", "बस", "मिनिबस", "कार", "टेम्पो", "बस");
            this.addQuestion(q112);
            Question q113 = new Question("सवारीमा भएको ब्याट्री कसरि चार्ज हुन्छ?", "गाडीको इन्जिनबाट", "गाडीको इन्धनबाट", "गाडीको डाइनामोबाट", "माथिका सबै", "गाडीको डाइनामोबाट");
            this.addQuestion(q113);
            Question q114 = new Question("गाडी चलिरहेको बेलामा रोक्न परेमा कुन सिग्नल दिएर रोक्ने?", "हेड लाईट", "इमर्जेन्सी लाईट", "साइड लाईट", "ब्रेक लाईट", "ब्रेक लाईट");
            this.addQuestion(q114);
            Question q115 = new Question("सबारी चालक अनुमति पत्रको नवीकरण कहिले हुनुपर्छ?", "प्रत्येक वर्ष", "२ बर्षमा", "३ बर्षमा", "५ बर्षमा", "५ बर्षमा");
            this.addQuestion(q115);
            Question q116 = new Question("झुठा नुम्बर प्लेट राखी सवारी चलाएमा के सजाय हुन्छ?", "६ महिना कैद", "सबारी जफत", "५ हजार देखि १५ हजार जरिवाना", "माथिका सबै हुन सक्छा", "माथिका सबै हुन सक्छा");
            this.addQuestion(q116);
            Question q117 = new Question("सवारी चालकको आवस्था तलको मध्ये कस्तो हुनु जरुरी छ?", "मा.पा.से. नगरको", "नथाकेको", "राम्रो देखने", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q117);
            Question q118 = new Question("नेपाल अधिराज्य भरमा यातायात कार्यालय कति अंचलमा छन्?", "८", "१४", "१२", "१३", "१३");
            this.addQuestion(q118);
            Question q119 = new Question("सवारीमा विधुत उत्पादन गर्नी साधन के हो?", "ब्याट्री", "डाइनामा", "पेट्रोल", "डिजेल", "ब्याट्री");
            this.addQuestion(q119);
            Question q120 = new Question("सवारी साधनको धुँवा कहाँबाट निस्कन्छ?", "चक्का बाट", "साइलेन्सर बाट", "इन्जिन बाट", "माथिका सबै ", "साइलेन्सर बाट");
            this.addQuestion(q120);
            Question q121 = new Question("साधारण आवस्थामा के को मद्दतले गति घटाउनु पर्छ?", "गियरको मद्दतले", "ब्रेकको मद्दतले", "क्लचको मद्दतले", "एक्सिलेरेटरको मद्दतले", "गियरको मद्दतले");
            this.addQuestion(q121);
            Question q122 = new Question("सवारी साधनको सबैभन्दा महात्वपूर्ण लाइट कुन हो?", "साइड लाइट ", "ब्याक लाइट", "हेड लाइट", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q122);
            Question q123 = new Question("स्किड मार्क के लाई भनिन्छ?", "इमर्जेन्सी ब्रेकको दागलाई ", "सडकको पहेंलो रेखालाई", "सडकको सेतो रेखालाई", "माथिका सबै", "इमर्जेन्सी ब्रेकको दागलाई ");
            this.addQuestion(q123);
            Question q124 = new Question ("एक तर्फी सडकमा कस्तो अवस्थामा बदी दुर्घटना हुन्छन्?", " अचानक लेन बदल्दा ", "ओभरटेक गर्दा", "मन्द गतिमा चलाउदा","तिब्र गतिमा चलाउदा"," अचानक लेन बदल्दा ");
            this.addQuestion(q124);
            Question q125 = new Question ("कस्ता व्यक्तीहरुले लाइसेन्स पाउदैन ?", "पूर्ण शाररिक अपाङ्गा", "छारे रोग र रतन्धो भएका व्यक्तिले", "उमेर नपुगेकाले", "माथिको सबै", "माथिको सबै");
            this.addQuestion(q125);
            Question q126 = new Question ("सवारी कर आर्थिक बर्षको कुन महिनामा तिरिसकेको हुनुपर्दछ अन्यथा जरिवान लाग्छ?","चैत्र मसान्त भित्र", "बैशाख मसान्त भित्र", "असार मसान्त भित्र", "श्रावण मसान्त भित्र", "चैत्र मसान्त भित्र");
            this.addQuestion(q126);
            Question q127 = new Question ("कुन सवारीहरुलाई गती सिमा ( Speed Limit) लागु हुँदैन ? ", "एम्बुलेन्स, दमकल , भिआइपी र पुलिस सवारी र US Embassy सवारीलाई", "एम्बुलेन्स, दमकल , भिआइपी र पुलिस सवारी र INGOs को सवारीलाई", "एम्बुलेन्स, दमकल , भिआइपी , पुलिस सवारी र कलाकारको सवारिलाई","एम्बुलेन्स, दमकल , भिआइपी र पुलिस सवारीलाई", "एम्बुलेन्स, दमकल , भिआइपी र पुलिस सवारीलाई");
            this.addQuestion(q127);
            Question q128 = new Question ("सवारी भनेको के हो ? ", " पेट्रोल शक्ती द्वारा सन्चालन भइ मानिस वा बस्तु ओसारपोसार गर्ने यन्त्र", " चालक शक्ती द्वारा सन्चालन भइ मानिस वा बस्तु ओसारपोसार गर्ने यन्त्र ", "यान्त्रिक शक्ती द्वारा सन्चालन भइ मानिस वा बस्तु ओसारपोसार गर्ने यन्त्र","माथिको सबै","यान्त्रिक शक्ती द्वारा सन्चालन भइ मानिस वा बस्तु ओसारपोसार गर्ने यन्त्र");
            this.addQuestion(q128);
            Question q129 = new Question ("कतिबेला तपाइको सवारी फूटपाथमा चलाऊन सक्नुहुन्छ ?", "ट्राफिक जाम परेकोबेला ", " अरु गाडी बिस्तारै चलेकोबेला ओभरटेक गर्न ", "पैदल यात्री नभएको बेला", "कहिलै पनि मिल्दैन","कहिलै पनि मिल्दैन");
            this.addQuestion(q129);
            Question q130 = new Question ("अशल ड्राइभरमा हुनुपर्ने गुणहरु के के हुन ?", "सहनशिलता", "आत्मबिश्वास, निर्णयकता ", " धैर्यता ", "माथिको सबै", "माथिको सबै");
            this.addQuestion(q130);
            Question q131 = new Question("मोटरसाइकलको लिखित परीक्षामा सम्मिलित हुन दरखास्थ दस्तुर वापर कति रकम लाग्छ?", "रू १००", "रू ५००", "रू ३००", "रु ४००", "रू ५००");
            this.addQuestion(q131);
            Question q132 = new Question("सडकको रेखांकन कुन कुन रंगको प्रयोग गरिन्छ?", "सेतो र पहेंलो", "निलो र रातो", "कालो र पहेंलो", "हरियो र पहेंलो", "सेतो र पहेंलो");
            this.addQuestion(q132);
            Question q133 = new Question("कस्तो रङ छुटयाउन नसक्ने चालक आनुमति पत्र प्राप्त गर्न सक्दैनन्?", "कालो", "रातो", "निलो", "सेतो", "रातो");
            this.addQuestion(q133);
            Question q134 = new Question("सवारी साधनको नम्बर प्लेटमा कतिवटा सम्म अंक हुन्छ?", "२", "३", "५", "४", "४");
            this.addQuestion(q134);
            Question q135 = new Question("नेपालमा सवारी साधनका नम्बर प्लेट कति किसिमका हुन्छन?", "२", "३", "६", "७", "६");
            this.addQuestion(q135);
            Question q136 = new Question("हेल्मेट लगाउनुको मुख्य कारण के हो?", "राम्रो देख्नुको लागि", "दुर्घटनाबाट बचन", "सजायबाट बचन", "ट्राफिकको डरले", "दुर्घटनाबाट बचन");
            this.addQuestion(q136);
            Question q137 = new Question("ब्रेकको काम के हो?", "रोक्ने", "छिटो गुदाउने", "ब्याक गर्ने", "स्लो गर्ने", "रोक्ने");
            this.addQuestion(q137);
            Question q138 = new Question("प्रदुषण मुक्त शहर बनाउनलाई कुन सवारी राम्रो हुन्छ?", "ग्यास", "डिजेल", "पेट्रोल", "विधुत", "विधुत");
            this.addQuestion(q138);
            Question q139 = new Question("पिक आवर भनेर कुन समयलाई भनिन्छ?", "अफिस छुट्ने र लाग्ने १ घण्टा अघि पछाडीको समय", "खाजा खाने समय", "बेलुकाको समय", "बिहानको समय", "अफिस छुट्ने र लाग्ने १ घण्टा अघि पछाडीको समय");
            this.addQuestion(q139);
            Question q140 = new Question("कस्तो ठाउँमा सवारीको गति कम गर्नुपर्छ?", "स्कूल छेत्रमा", "चौबाटोमा", "बाक्लो बस्ति भएको ठाउँमा", "माथिका सबै", "माथिका सबै");
            this.addQuestion(q140);
            Question q141 = new Question("बाक्लो बस्ति भएको इलाकामा सवारीको गति कति हुनुपर्छ ?", "२० कि.मि.", "३० कि.मि.", "४० कि.मि.", "५० कि.मि.", "२० कि.मि.");
            this.addQuestion(q141);
            Question q142 = new Question("दुर्घटनामा परेको घाइतेलाई तुरुन्त खान दिनु हुन्छ कि हुन्न?", "हुदैन", "हुन्छ", "जे गरेपनि हुन्छ", "माथिका सबै", "हुदैन");
            this.addQuestion(q142);
            Question q143 = new Question("सवारी साधन दायाँ मोड्दा के गर्नुपर्छ?", "बायाँ इन्डीकेटर बाल्ने", "दायाँ इन्डीकेटर बाल्ने", "हर्न बजाउने", "पार्किंग लिइट बाल्ने", "दायाँ इन्डीकेटर बाल्ने");
            this.addQuestion(q143);
            Question q144 = new Question("रातो बत्ति के को संकेत हो?", "खतरा", "सान्ति", "निसेध", "कुनै पनि हैन", "खतरा");
            this.addQuestion(q144);
            Question q145 = new Question("दुर्घटनामा घाइतेले बान्ता गर्यो भने कसरी सुताउनु पर्छ?", "उत्तानो पारेर", "घोप्टो पारेर", "जसरि सुताए पनि हुन्छ", "कुनै पनि हैन", "घोप्टो पारेर");
            this.addQuestion(q145);
            Question q146 = new Question("सवारी ऐन नियम कुन कुन ठाउँमा लागु हुन्छ?", "नेपाल अधिराज्य भरी", "बिराटनगर", "पोखरा", "काठमाडौँ", "नेपाल अधिराज्य भरी");
            this.addQuestion(q146);
            Question q147 = new Question("हरियो बत्ती संकेतले चालकलाई के बुझौउँछ?", "सुरक्षित", "खतरा", "इमर्जेन्सी", "साबधान", "सुरक्षित");
            this.addQuestion(q147);
            Question q148 = new Question("सार्बजनिक सवारीलाई कति भागमा विभाजित गरिएको छ?", "१ भागमा", "२ भागमा", "४ भागमा", "६ भागमा", "२ भागमा");
            this.addQuestion(q148);
            Question q149 = new Question("इन्जिनको पार्ट पुर्जा चिल्लो बनाउने काम के ले गर्छ?", "मोबिलले", "खाने तेलले ", "पेट्रोल", "माथिका सबै", "मोबिलले");
            this.addQuestion(q149);
            Question q150 = new Question("दुर्घटनाको घाइतेलाई अक्सिजन कति समयसम्म दिनुपर्छ?", "२ घण्टा सम्म", "३ घण्टा सम्म", "होस् नआएसम्म", "जति दियो त्यति राम्रो", "होस् नआएसम्म");
            this.addQuestion(q150);
            Question q151 = new Question("मोटरसाइकल चलाउने चालकले कस्तो प्रकारको कपडा लगाउनु पर्छ?", "चम्किलो र बाक्लो", "कालो", "मधुरो", "पातलो", "चम्किलो र बाक्लो");
            this.addQuestion(q151);

        // END
    }
    @Override
    public void onUpgrade(SQLiteDatabase db, int oldV, int newV) {
// Drop older table if existed
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST);
// Create tables again
        onCreate(db);
    }
    // Adding new question
    public void addQuestion(Question questi) {
// SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values = new ContentValues();
        values.put(KEY_QUES, questi.getQUESTION());
        values.put(KEY_ANSWER, questi.getANSWER());
        values.put(KEY_OPTA, questi.getOPTA());
        values.put(KEY_OPTB, questi.getOPTB());
        values.put(KEY_OPTC, questi.getOPTC());
        values.put(KEY_OPTD, questi.getOPTD());
// Inserting Row
        dbase.insert(TABLE_QUEST, null, values);
    }
    public List<Question> getAllQuestions() {
        List<Question> quesList = new ArrayList<Question>();
// Select All Query
        String selectQuery = "SELECT * FROM " + TABLE_QUEST + " ORDER BY RANDOM() LIMIT 50";
        dbase = this.getReadableDatabase();
        Cursor cursor = dbase.rawQuery(selectQuery, null);
// looping through all rows and adding to list
        if (cursor.moveToFirst()) {
            do {
                Question quest = new Question();
                quest.setID(cursor.getInt(0));
                quest.setQUESTION(cursor.getString(1));
                quest.setANSWER(cursor.getString(2));
                quest.setOPTA(cursor.getString(3));
                quest.setOPTB(cursor.getString(4));
                quest.setOPTC(cursor.getString(5));
                quest.setOPTD(cursor.getString(6));
                quesList.add(quest);
            } while (cursor.moveToNext());
        }
// return quest list
        return quesList;
    }

}
